# Extra messages
decline_msg = '<b>Отмена операции!</b>'
inner_error_msg = '<b>Внутреняя ошибка!</b>\n\nПопробуйте воспользоваться чат-ботом позже 😵'

# Basic messages
start_msg = ('<b>Добро пожаловать!</b> 👋\n\n'
                   'Этот бот предназначен для генерации изображений с использованием моделей DALL-E 2 и DALL-E 3.\n\n'
                   'Пожалуйста, ознакомьтесь с доступными командами с помощью <i>/help</i>.')

help_msg = ('<b>📜 Доступные команды:</b>\n\n'
                '<i>/help</i> - показать список доступных команд 📋\n\n'
                '<i>/generate</i> - сгенерировать изображение с помощью DALL-E 🤖 \n\n'
                '<i>/settings</i> - настройка параметров генерации изображения ⚙️\n\n')

# Generate messages
send_prompt_msg = '<b>Введите текст для генерации ✏️</b>'
send_prompt_error_msg = '<b>Неверный ввод данных!</b>\n\nОтправьте текст еще раз 🔄'
generating_msg = '<i>Подождите окончание генерации ⌛</i>'

# Settings messages
choose_model_msg = '<b>Выберите модель 🤖</b>\n\nГенерация: <i>/generate</i>'
choose_size_msg = '<b>Выберите размер изображения 🖼️</b>\n\nГенерация: <i>/generate</i>'
choose_quantity_msg = '<b>Выберите количество 🔢</b>\n\nГенерация: <i>/generate</i>'
